#!/bin/bash
set -euo pipefail

SCRIPT_DIR="$(cd -- "$(dirname -- "${BASH_SOURCE[0]}")" && pwd)"
PACKAGES_DIR="${SCRIPT_DIR}/../packages"


# ██████╗  █████╗  ██████╗███╗   ███╗ █████╗ ███╗   ██╗
# ██╔══██╗██╔══██╗██╔════╝████╗ ████║██╔══██╗████╗  ██║
# ██████╔╝███████║██║     ██╔████╔██║███████║██╔██╗ ██║
# ██╔═══╝ ██╔══██║██║     ██║╚██╔╝██║██╔══██║██║╚██╗██║
# ██║     ██║  ██║╚██████╗██║ ╚═╝ ██║██║  ██║██║ ╚████║
# ╚═╝     ╚═╝  ╚═╝ ╚═════╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝                                               


# Source the package arrays
source "${PACKAGES_DIR}/pacman.conf"

# Combine all arrays
ALL_PACKAGES=(
  "${BASE[@]}"
  "${SECURITY[@]}"
  "${GRAPHICS[@]}"
  "${TERMINAL[@]}"
  "${TERMINAL_UTILS[@]}"
  "${HYPRLAND[@]}"
  "${HYPRLAND_EXTRA[@]}"
  "${FILE_MANAGER[@]}"
  "${APPS[@]}"
  "${APP_PLUGINS[@]}"
  "${LSP[@]}"
  "${AUDIO[@]}"
  "${FONTS[@]}"
  "${THEMING[@]}"
  "${DAEMONS[@]}"
)

# Install all packages
sudo pacman -Syu --needed "${ALL_PACKAGES[@]}"


# ██╗   ██╗ █████╗ ██╗   ██╗
# ╚██╗ ██╔╝██╔══██╗╚██╗ ██╔╝
#  ╚████╔╝ ███████║ ╚████╔╝ 
#   ╚██╔╝  ██╔══██║  ╚██╔╝  
#    ██║   ██║  ██║   ██║   
#    ╚═╝   ╚═╝  ╚═╝   ╚═╝   


source "${PACKAGES_DIR}/aur.conf"

if ! command -v yay &>/dev/null; then
    sudo pacman -S --needed --noconfirm git base-devel
    git clone https://aur.archlinux.org/yay.git /tmp/yay
    pushd /tmp/yay
    makepkg -si --noconfirm
    popd
    rm -rf /tmp/yay
fi

# Install AUR packages
for pkg in "${APPS[@]}"; do
    yay -S --needed "$pkg" --noconfirm
done
